#pragma once
#include <string>

 /**
  * @class IStorable
  * @brief Абстрактний базовий клас (інтерфейс) для об'єктів,
  * що можуть зберігатися.
  *
  * Визначає загальний контракт, який повинні реалізувати всі класи-нащадки,
  * наприклад, надавати унікальний ідентифікатор та назву типу.
  */
class IStorable
{
public:
    /**
     * @brief Віртуальний деструктор.
     *
     * Забезпечує коректне викликання деструкторів похідних класів
     * при видаленні об'єктів через вказівник на базовий клас.
     */
    virtual ~IStorable() {}

    /**
     * @brief Отримує унікальний ідентифікатор об'єкта (артикул).
     * @return Рядок std::string, що містить ID.
     */
    virtual std::string GetId() const = 0;

    /**
     * @brief Отримує назву типу об'єкта.
     * @return Рядок std::string (наприклад, "Book").
     */
    virtual std::string GetTypeName() const = 0;
};